In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import warnings
import missingno as msno
warnings.filterwarnings('ignore')
%matplotlib inline
from sklearn.model_selection import train_test_split
from sklearn import preprocessing
from sklearn.preprocessing import OrdinalEncoder
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import StandardScaler
from sklearn import svm

In [3]:
rand_state= 1000

In [4]:
file_core_path = '/Users/gauridhumal/Development Projects/UOL-PROJECTs/CRS/DS/crs_ds/data/raw/entity/imdb_movie_db/'

# Process name.basics.tsv file

In [5]:
#Read the file and load the contents in a dataframe.
filename = 'name.basics.tsv'
file_path = file_core_path + filename
df_imdb_name_basics=pd.read_csv(open(file_path, 'r'),delimiter='\t')

In [6]:
df_imdb_name_basics.head()

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0000001,Fred Astaire,1899,1987,"soundtrack,actor,miscellaneous","tt0050419,tt0072308,tt0053137,tt0031983"
1,nm0000002,Lauren Bacall,1924,2014,"actress,soundtrack","tt0117057,tt0037382,tt0075213,tt0038355"
2,nm0000003,Brigitte Bardot,1934,\N,"actress,soundtrack,music_department","tt0056404,tt0054452,tt0057345,tt0049189"
3,nm0000004,John Belushi,1949,1982,"actor,soundtrack,writer","tt0072562,tt0078723,tt0077975,tt0080455"
4,nm0000005,Ingmar Bergman,1918,2007,"writer,director,actor","tt0050976,tt0069467,tt0050986,tt0083922"

In [7]:
df_imdb_name_basics.describe()

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
count,12926670,12926664,12926670,12926670,10366245,12926670
unique,12926670,9996254,526,469,21582,5514406
top,nm0000001,Alex,\N,\N,actor,\N
freq,1,434,12332993,12705616,2336508,1400550

## Extract Movie Professions

In [8]:
df_profession = df_imdb_name_basics['primaryProfession']

In [9]:
df_profession['split'] = df_profession.str.split(',', expand=True)

In [10]:
df_profession_1 = df_profession['split'][0]
df_profession_2 = df_profession['split'][1]
df_profession_3 = df_profession['split'][2]

In [11]:
df_profession_total = pd.concat([df_profession_1,df_profession_2,df_profession_3])

In [12]:
df_profession_total.drop_duplicates(inplace=True)

In [13]:
df_profession_total.isna().sum()

2

In [14]:
df_profession_total.dropna(inplace=True)

In [15]:
df_profession_total.size

43

In [16]:
df_profession_total.columns=["profession"]

In [17]:
# Save Professions as entity
df_profession_total.to_csv('/Users/gauridhumal/Development Projects/UOL-PROJECTs/CRS/DS/crs_ds/data/processed/entity/entity_movie_professions.csv', index=False, header=['profession'])

## Clean Primary Name

In [18]:
df_imdb_name_basics.shape

(12926670, 6)

In [19]:
df_imdb_name_basics.tail(10)

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
12926660,nm9993709,Lu Bevins,\N,\N,"producer,director,writer","tt17717854,tt11772812,tt11697102,tt11772904"
12926661,nm9993710,Nestor Rudnytskyy,\N,\N,NaN,\N
12926662,nm9993711,David Gluzman,\N,\N,NaN,\N
12926663,nm9993712,Corny O'Connell,\N,\N,NaN,\N
12926664,nm9993713,Sambit Mishra,\N,\N,"writer,producer","tt27191658,tt15134202,tt20319332,tt10709066"
12926665,nm9993714,Romeo del Rosario,\N,\N,"animation_department,art_department","tt11657662,tt2455546,tt14069590"
12926666,nm9993716,Essias Loberg,\N,\N,NaN,\N
12926667,nm9993717,Harikrishnan Rajan,\N,\N,cinematographer,tt8736744
12926668,nm9993718,Aayush Nair,\N,\N,cinematographer,tt8736744
12926669,nm9993719,Andre Hill,\N,\N,NaN,\N

In [20]:
df_imdb_name_basics.isna().sum()

nconst                     0
primaryName                6
birthYear                  0
deathYear                  0
primaryProfession    2560425
knownForTitles             0
dtype: int64

In [21]:
mask = df_imdb_name_basics['primaryName'].isna()

In [22]:

df_imdb_name_basics[mask]

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
101017,nm0106021,NaN,\N,\N,actor,"tt21610866,tt0091791"
1790471,nm10927938,NaN,\N,\N,"art_department,composer","tt16401648,tt10837972"
4949813,nm14292439,NaN,\N,\N,NaN,\N
4985451,nm14334668,NaN,\N,\N,director,\N
5017089,nm14381073,NaN,\N,\N,"director,writer","tt29359666,tt25049436"
7341614,nm3177777,NaN,\N,\N,actress,tt1315061

In [23]:
df_imdb_name_basics = df_imdb_name_basics[~mask]

In [24]:
df_imdb_name_basics.shape

(12926664, 6)

In [25]:
df_imdb_name_basics.isnull().sum()

nconst                     0
primaryName                0
birthYear                  0
deathYear                  0
primaryProfession    2560424
knownForTitles             0
dtype: int64

## Clean primary profession

In [26]:
df_imdb_name_basics.fillna('',inplace=True)

In [27]:
df_imdb_name_basics.isnull().sum()

nconst               0
primaryName          0
birthYear            0
deathYear            0
primaryProfession    0
knownForTitles       0
dtype: int64

## Save Cleaned up DF in a new file.

In [28]:
df_imdb_name_basics.to_csv('/Users/gauridhumal/Development Projects/UOL-PROJECTs/CRS/DS/crs_ds/data/processed/imdb/cleaned_name.basics.csv', index=False,)

# Process title.basics.tsv file

In [29]:
#Read the file and load the contents in a dataframe.
filename = 'title.basics.tsv'
file_path = file_core_path + filename
df_imdb_title_basics=pd.read_csv(open(file_path, 'r'),delimiter='\t')

In [30]:
df_imdb_title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

In [31]:
df_imdb_title_basics.describe()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
count,10232315,10232315,10232298,10232298,10232315,10232315,10232315,10232315,10232297
unique,10232315,11,4603543,4626135,14,153,96,900,2352
top,tt0000001,tvEpisode,Episode #1.1,Episode #1.1,0,\N,\N,\N,Drama
freq,1,7800305,49408,49408,9846001,1369014,10118715,7145498,1171225

In [32]:
df_imdb_title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10232315 entries, 0 to 10232314
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   tconst          object
 1   titleType       object
 2   primaryTitle    object
 3   originalTitle   object
 4   isAdult         object
 5   startYear       object
 6   endYear         object
 7   runtimeMinutes  object
 8   genres          object
dtypes: object(9)
memory usage: 702.6+ MB

In [33]:
df_imdb_title_basics[df_imdb_title_basics['primaryTitle'].duplicated() & df_imdb_title_basics['startYear'].duplicated() ]

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
20,tt0000022,short,Blacksmith Scene,Les forgerons,0,1895,\N,1,"Documentary,Short"
220,tt0000223,short,L'aveugle,L'aveugle,0,1899,\N,\N,Short
227,tt0000230,short,Cinderella,Cendrillon,0,1899,\N,6,"Drama,Family,Fantasy"
229,tt0000232,short,Le chiffonnier,Le chiffonnier,0,1899,\N,\N,"Comedy,Short"
277,tt0000280,short,Buffalo Bill's Wild West Parade,Buffalo Bill's Wild West Parade,0,1900,\N,\N,"News,Short"
...,...,...,...,...,...,...,...,...,...
10232309,tt9916846,tvEpisode,Episode #3.18,Episode #3.18,0,2009,\N,\N,"Action,Drama,Family"
10232310,tt9916848,tvEpisode,Episode #3.17,Episode #3.17,0,2009,\N,\N,"Action,Drama,Family"
10232311,tt9916850,tvEpisode,Episode #3.19,Episode #3.19,0,2010,\N,\N,"Action,Drama,Family"
10232312,tt9916852,tvEpisode,Episode #3.20,Episode #3.20,0,2010,\N,\N,"Action,Drama,Family"
10232313,tt9916856,short,The Wind,The Wind,0,2015,\N,27,Short

In [34]:
df_imdb_title_basics.shape

(10232315, 9)

In [35]:
df_imdb_title_basics.columns

Index(['tconst', 'titleType', 'primaryTitle', 'originalTitle', 'isAdult',
       'startYear', 'endYear', 'runtimeMinutes', 'genres'],
      dtype='object')

In [36]:
df_imdb_title_basics.isnull().sum()

tconst             0
titleType          0
primaryTitle      17
originalTitle     17
isAdult            0
startYear          0
endYear            0
runtimeMinutes     0
genres            18
dtype: int64

In [37]:
df_imdb_title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10232315 entries, 0 to 10232314
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   tconst          object
 1   titleType       object
 2   primaryTitle    object
 3   originalTitle   object
 4   isAdult         object
 5   startYear       object
 6   endYear         object
 7   runtimeMinutes  object
 8   genres          object
dtypes: object(9)
memory usage: 702.6+ MB

## Clean isAdult

In [38]:
df_imdb_title_basics['isAdult'].value_counts()

isAdult
0       9846001
1        320761
0         63478
1          2057
2023          6
2019          3
2020          2
1981          1
2017          1
\N            1
2022          1
2011          1
2014          1
2005          1
Name: count, dtype: int64

In [39]:
df_imdb_title_basics.loc[df_imdb_title_basics['isAdult'].isin(['0']), ['isAdult']]=0

In [40]:
df_imdb_title_basics.loc[df_imdb_title_basics['isAdult'].isin(['1']), ['isAdult']]=1

In [41]:
df_imdb_title_basics.loc[df_imdb_title_basics['isAdult'].isin([2023,2019,2020,1981,2017,2022,2011,2014,2005,'\\N']), ['isAdult']]=0

In [42]:
df_imdb_title_basics['isAdult'].value_counts()

isAdult
0    9909497
1     322818
Name: count, dtype: int64

## Extract Title types

In [43]:
df_imdb_title_basics['titleType'].value_counts()

titleType
tvEpisode       7800305
short            956297
movie            659698
video            281512
tvSeries         250546
tvMovie          143205
tvMiniSeries      50776
tvSpecial         43758
videoGame         36181
tvShort           10036
tvPilot               1
Name: count, dtype: int64

In [44]:
df_title_type = pd.DataFrame(df_imdb_title_basics['titleType'].unique())

In [45]:
df_title_type.shape

(11, 1)

In [46]:
df_title_type.columns=["t_type"]

## Save title types as Entity

In [47]:
# Save Geners as entity
df_title_type.to_csv('/Users/gauridhumal/Development Projects/UOL-PROJECTs/CRS/DS/crs_ds/data/processed/entity/entity_movie_title_type.csv', index=False)

## Extract Genres

In [48]:
df_genres = df_imdb_title_basics['genres']

In [49]:
df_genres['split'] = df_genres.str.split(',', expand=True)

In [50]:
df_genres_1 = pd.DataFrame(df_genres.split[0].unique())
df_genres_1.columns = ['genres']

In [51]:
df_genres_2 = pd.DataFrame(df_genres.split[1].unique())
df_genres_2.columns = ['genres']

In [52]:
df_genres_3 = pd.DataFrame(df_genres.split[2].unique())
df_genres_3.columns = ['genres']

In [53]:
print(df_genres_1['genres'].unique().size)
print(df_genres_2['genres'].unique().size)
print(df_genres_3['genres'].unique().size)

30
29
28

In [54]:
df_genres_total = pd.concat([df_genres_1,df_genres_2,df_genres_3])

In [55]:
df_genres_total.describe()

             genres
count            82
unique           29
top     Documentary
freq              3

In [56]:
mask = df_genres_total['genres'] == '\\N'

In [57]:
df_genres_total = df_genres_total[~mask]

In [58]:
df_genres_total_cleaned = df_genres_total.drop_duplicates().dropna()

## Save Genres as Entity

In [59]:
# Save Geners as entity
df_genres_total_cleaned.to_csv('/Users/gauridhumal/Development Projects/UOL-PROJECTs/CRS/DS/crs_ds/data/processed/entity/entity_movie_genres.csv', index=False)

## Clean primary title, originalTitle and Genres

In [60]:
df_imdb_title_basics.isna().sum()

tconst             0
titleType          0
primaryTitle      17
originalTitle     17
isAdult            0
startYear          0
endYear            0
runtimeMinutes     0
genres            18
dtype: int64

In [61]:
mask = df_imdb_title_basics['primaryTitle'].isna()

In [62]:
df_imdb_title_basics[mask]

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
625923,tt0648118,tvEpisode,NaN,NaN,0,1987,\N,\N,"Crime,Drama,Mystery"
1253840,tt10516578,video,NaN,NaN,0,2017,\N,\N,"Music,Short"
3433445,tt14510930,tvEpisode,NaN,NaN,0,\N,\N,\N,\N
4077190,tt15700278,tvEpisode,NaN,NaN,0,2021,\N,\N,Talk-Show
4559122,tt17042812,movie,NaN,NaN,0,2010,\N,87,Thriller
5067375,tt1971246,tvEpisode,NaN,NaN,0,2011,\N,\N,Biography
5263256,tt2067043,tvEpisode,NaN,NaN,0,1965,\N,\N,Music
5602217,tt21883066,tvEpisode,NaN,NaN,0,2022,\N,\N,"News,Talk-Show"
5872238,tt2305914,tvEpisode,NaN,NaN,0,\N,\N,\N,"Comedy,Talk-Show"
5872247,tt2305918,tvEpisode,NaN,NaN,0,\N,\N,\N,"Comedy,Talk-Show"
7294810,tt3383210,short,NaN,NaN,0,2013,\N,12,"Documentary,History,Short"
8336519,tt5746000,short,NaN,NaN,0,2016,\N,12,Short
8348101,tt5773048,tvEpisode,NaN,NaN,0,2015,\N,\N,Talk-Show
8348544,tt5774076,movie,NaN,NaN,0,2015,\N,\N,"Action,Drama,Mystery"
9569219,tt8473688,tvEpisode,NaN,NaN,0,1987,\N,\N,Drama
9600275,tt8541336,tvEpisode,NaN,NaN,0,2018,\N,30,"Reality-TV,Romance"
10189667,tt9824302,tvEpisode,NaN,NaN,0,2016,\N,\N,Documentary

In [63]:
df_imdb_title_basics = df_imdb_title_basics[~mask]

In [64]:
df_imdb_title_basics.isna().sum()

tconst             0
titleType          0
primaryTitle       0
originalTitle      0
isAdult            0
startYear          0
endYear            0
runtimeMinutes     0
genres            18
dtype: int64

In [65]:
df_imdb_title_basics['genres'].fillna('',inplace=True)

In [66]:
df_imdb_title_basics.isna().sum()

tconst            0
titleType         0
primaryTitle      0
originalTitle     0
isAdult           0
startYear         0
endYear           0
runtimeMinutes    0
genres            0
dtype: int64

## Save cleaned file

In [67]:
df_imdb_title_basics.to_csv('/Users/gauridhumal/Development Projects/UOL-PROJECTs/CRS/DS/crs_ds/data/processed/imdb/cleaned_title_basics.csv', index=False,)

# Process title.akas.tsv file

In [68]:
#Read the file and load the contents in a dataframe.
filename = 'title.akas.tsv'
file_path = file_core_path + filename
df_imdb_title_akas=pd.read_csv(open(file_path, 'r'),delimiter='\t')

In [69]:
df_imdb_title_akas.head(10)

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,ÐšÐ°Ñ€Ð¼ÐµÐ½ÑÑ–Ñ‚Ð°,UA,\N,imdbDisplay,\N,0
1,tt0000001,2,Carmencita,DE,\N,\N,literal title,0
2,tt0000001,3,Carmencita - spanyol tÃ¡nc,HU,\N,imdbDisplay,\N,0
3,tt0000001,4,ÎšÎ±ÏÎ¼ÎµÎ½ÏƒÎ¯Ï„Î±,GR,\N,imdbDisplay,\N,0
4,tt0000001,5,ÐšÐ°Ñ€Ð¼ÐµÐ½ÑÐ¸Ñ‚Ð°,RU,\N,imdbDisplay,\N,0
5,tt0000001,6,Carmencita,US,\N,imdbDisplay,\N,0
6,tt0000001,7,Carmencita,\N,\N,original,\N,1
7,tt0000001,8,ã‚«ãƒ«ãƒ¡ãƒ³ãƒãƒ¼ã‚¿,JP,ja,imdbDisplay,\N,0
8,tt0000002,1,Le clown et ses chiens,\N,\N,original,\N,1
9,tt0000002,2,Le clown et ses chiens,FR,\N,imdbDisplay,\N,0

In [70]:
df_imdb_title_akas[df_imdb_title_akas['titleId']=='tt0000020']

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
202,tt0000020,1,The Derby 1895,\N,\N,original,\N,1
203,tt0000020,2,Ð”ÐµÑ€Ð±Ð¸ 1895,RU,\N,imdbDisplay,\N,0
204,tt0000020,3,The Derby 1895,GB,\N,imdbDisplay,\N,0

In [71]:
df_imdb_title_akas[df_imdb_title_akas['titleId']=='0'].shape

(0, 8)

In [72]:
df_imdb_title_akas['types'].value_counts()

types
\N                      31788579
imdbDisplay              3605845
original                 1827006
alternative               117648
working                    55072
dvd                        22068
video                      21196
festival                   19568
tv                         18770
dvdimdbDisplay              218
imdbDisplaytv                72
festivalimdbDisplay          66
imdbDisplayworking           31
imdbDisplayvideo             26
alternativetv                 9
tvvideo                       7
alternativedvd                6
videoworking                  5
alternativeworking            5
tvworking                     4
festivalworking               3
dvdvideo                      2
alternativefestival           2
alternativevideo              1
Name: count, dtype: int64

In [73]:
df_imdb_title_akas['attributes'].value_counts()

attributes
\N                                     37208582
transliterated title                      28363
alternative spelling                      20252
new title                                 18363
literal English title                     16026
                                         ...
first four episodes title                     1
first two episodes title                      1
Locarno film festival title                   1
first three episodes title                    1
8mm release titlesecond part title           1
Name: count, Length: 188, dtype: int64

In [74]:
df_imdb_title_akas['isOriginalTitle'].value_counts()

isOriginalTitle
0     22466774
0     13180352
1      1320717
1       506289
\N        2077
Name: count, dtype: int64

In [75]:
df_imdb_title_akas.shape

(37476209, 8)

In [76]:
df_imdb_title_akas.isna().sum()

titleId              0
ordering             0
title               18
region             117
language             0
types                0
attributes           0
isOriginalTitle      0
dtype: int64

## Clean title

In [77]:
mask = df_imdb_title_akas['title'].isna()

In [78]:
df_imdb_title_akas[mask]

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
4555324,tt10516578,1,NaN,CA,\N,\N,\N,0
9467474,tt12751522,1,NaN,\N,\N,\N,\N,0
10272493,tt13120684,1,NaN,MX,\N,imdbDisplay,\N,0
10272494,tt13120684,2,NaN,\N,\N,\N,\N,0
16010242,tt15991740,3,NaN,MX,\N,imdbDisplay,\N,0
17284035,tt17042812,1,NaN,US,\N,\N,\N,0
20382228,tt21142340,3,NaN,CA,fr,imdbDisplay,\N,0
20382229,tt21142340,4,NaN,JP,ja,imdbDisplay,\N,0
22250907,tt23160494,1,NaN,IN,en,imdbDisplay,\N,0
27515491,tt3383210,2,NaN,\N,\N,original,\N,1
27515493,tt3383210,4,NaN,AU,\N,imdbDisplay,\N,0
28583097,tt4194078,2,NaN,\N,\N,\N,\N,0
30793968,tt5746000,1,NaN,IR,\N,\N,\N,0
30826508,tt5774076,1,NaN,GB,\N,imdbDisplay,\N,0
30826509,tt5774076,2,NaN,\N,\N,original,\N,1
30826510,tt5774076,3,NaN,US,\N,imdbDisplay,\N,0
34837391,tt8473688,1,NaN,IN,\N,\N,\N,0
34952687,tt8541336,1,NaN,DK,\N,\N,\N,0

In [79]:
df_imdb_title_akas = df_imdb_title_akas[~mask]

In [80]:
df_imdb_title_akas.shape

(37476191, 8)

In [81]:
df_imdb_title_akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,ÐšÐ°Ñ€Ð¼ÐµÐ½ÑÑ–Ñ‚Ð°,UA,\N,imdbDisplay,\N,0
1,tt0000001,2,Carmencita,DE,\N,\N,literal title,0
2,tt0000001,3,Carmencita - spanyol tÃ¡nc,HU,\N,imdbDisplay,\N,0
3,tt0000001,4,ÎšÎ±ÏÎ¼ÎµÎ½ÏƒÎ¯Ï„Î±,GR,\N,imdbDisplay,\N,0
4,tt0000001,5,ÐšÐ°Ñ€Ð¼ÐµÐ½ÑÐ¸Ñ‚Ð°,RU,\N,imdbDisplay,\N,0

## Check titles

In [82]:
# titles not found in the title basics file
df_imdb_title_akas[~df_imdb_title_akas['titleId'].isin(df_imdb_title_basics['tconst'])]

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
96371,tt0021453,1,Tapping Toes,US,\N,\N,\N,\N
107342,tt0023019,1,Hollywood on Parade,US,\N,\N,\N,\N
119581,tt0024677,1,Tom's in Town,US,\N,\N,\N,\N
209346,tt0036165,1,Missing Men,US,\N,\N,\N,\N
225682,tt0038098,1,Son of the Prairie,US,\N,\N,\N,\N
...,...,...,...,...,...,...,...,...
34920192,tt8524292,5,Folge #1.154,DE,de,\N,\N,0
34920193,tt8524292,6,EpisÃ³dio #1.154,PT,pt,\N,\N,0
34920194,tt8524292,7,Ã‰pisode #1.154,FR,fr,\N,\N,0
35725862,tt8982514,1,To The Bitter End,US,\N,\N,\N,0
36677293,tt9496006,1,Panther Brawl: A Documentary on the Masuk High...,US,\N,\N,\N,0

In [83]:
# drop these titles
df_imdb_title_akas.drop(df_imdb_title_akas[~df_imdb_title_akas['titleId'].isin(df_imdb_title_basics['tconst'])].index,inplace=True)

In [84]:
df_imdb_title_akas[~df_imdb_title_akas['titleId'].isin(df_imdb_title_basics['tconst'])]

Empty DataFrame
Columns: [titleId, ordering, title, region, language, types, attributes, isOriginalTitle]
Index: []

## Clean Region

In [85]:
df_imdb_title_akas.isna().sum()

titleId              0
ordering             0
title                0
region             117
language             0
types                0
attributes           0
isOriginalTitle      0
dtype: int64

In [86]:
df_imdb_title_akas.fillna('',inplace=True)

In [87]:
df_imdb_title_akas.isna().sum()

titleId            0
ordering           0
title              0
region             0
language           0
types              0
attributes         0
isOriginalTitle    0
dtype: int64

## Clean isOriginalTitle

In [88]:
df_imdb_title_akas['isOriginalTitle'].value_counts()

isOriginalTitle
0    22454672
0    13179566
1     1320693
1      506289
Name: count, dtype: int64

In [89]:
df_imdb_title_akas[df_imdb_title_akas['isOriginalTitle'].isin(['1'])].shape

(1320693, 8)

In [90]:
df_imdb_title_akas[df_imdb_title_akas['isOriginalTitle'].isin([1])].shape

(506289, 8)

In [91]:
df_imdb_title_akas[df_imdb_title_akas['isOriginalTitle'].isin(['0'])].shape

(22454672, 8)

In [92]:
df_imdb_title_akas[df_imdb_title_akas['isOriginalTitle'].isin([0])].shape

(13179566, 8)

In [93]:
df_imdb_title_akas.loc[df_imdb_title_akas['isOriginalTitle'].isin([1])] = '1'

In [94]:
df_imdb_title_akas.loc[df_imdb_title_akas['isOriginalTitle'].isin([0])] = '0'

In [95]:
df_imdb_title_akas.loc[df_imdb_title_akas['isOriginalTitle'].isin(['\\N'])] = '0'

In [96]:
df_imdb_title_akas['isOriginalTitle'].value_counts()

isOriginalTitle
0    35634238
1     1826982
Name: count, dtype: int64

## Save cleaned up file

In [97]:
df_imdb_title_akas.to_csv('/Users/gauridhumal/Development Projects/UOL-PROJECTs/CRS/DS/crs_ds/data/processed/imdb/cleaned_title.akas.csv', index=False,)

# Process title.crew.tsv file

In [98]:
#Read the file and load the contents in a dataframe.
filename = 'title.crew.tsv'
file_path = file_core_path + filename
df_imdb_title_crew=pd.read_csv(open(file_path, 'r'),delimiter='\t')

In [99]:
df_imdb_title_crew.head()

      tconst  directors writers
0  tt0000001  nm0005690      \N
1  tt0000002  nm0721526      \N
2  tt0000003  nm0721526      \N
3  tt0000004  nm0721526      \N
4  tt0000005  nm0005690      \N

In [100]:
df_imdb_title_crew.size

30704814

In [101]:
df_imdb_title_crew.describe()

           tconst directors   writers
count    10234938  10234938  10234938
unique   10234938    903666   1295977
top     tt0000001        \N        \N
freq            1   4345053   4920043

In [102]:
df_imdb_title_crew.isna().sum()

tconst       0
directors    0
writers      0
dtype: int64

## check titles

In [103]:
# titles not found in the title basics file
df_imdb_title_crew[~df_imdb_title_crew['tconst'].isin(df_imdb_title_basics['tconst'])]

              tconst   directors    writers
625922     tt0648118          \N         \N
1253838   tt10516578  nm10490012         \N
3433440   tt14510930          \N         \N
4077184   tt15700278          \N         \N
4559116   tt17042812   nm0002714  nm0002714
...              ...         ...        ...
8350727    tt5773048          \N         \N
8351170    tt5774076   nm6825011  nm6825011
9571844    tt8473688          \N         \N
9602900    tt8541336          \N         \N
10192290   tt9824302          \N         \N

[2687 rows x 3 columns]

In [104]:
# Drop not found titles
df_imdb_title_crew.drop(df_imdb_title_crew[~df_imdb_title_crew['tconst'].isin(df_imdb_title_basics['tconst'])].index,inplace=True)

In [105]:
df_imdb_title_crew[~df_imdb_title_crew['tconst'].isin(df_imdb_title_basics['tconst'])]

Empty DataFrame
Columns: [tconst, directors, writers]
Index: []

In [106]:
df_imdb_title_crew.tail(20)

,tconst,directors,writers
10234918,tt9916816,nm1485677,"nm9187127,nm1485677,nm9826385,nm9299459,nm1628284"
10234919,tt9916818,nm1485677,"nm9187127,nm1485677,nm9826385,nm9299459,nm1628284"
10234920,tt9916820,nm1485677,"nm9187127,nm1485677,nm9826385,nm9299459,nm1628284"
10234921,tt9916822,nm1485677,"nm9187127,nm1485677,nm9826385,nm9299459,nm1628284"
10234922,tt9916824,nm1485677,"nm9187127,nm1485677,nm9826385,nm9299459,nm1628284"
10234923,tt9916826,nm1485677,"nm9187127,nm1485677,nm9826385,nm9299459,nm1628284"
10234924,tt9916830,nm4289598,\N
10234925,tt9916832,nm1485677,"nm9187127,nm1485677,nm9826385,nm9299459,nm1628284"
10234926,tt9916834,nm1485677,"nm9187127,nm1485677,nm9826385,nm9299459,nm1628284"
10234927,tt9916836,nm1485677,"nm9187127,nm1485677,nm9826385,nm9299459,nm1628284"
10234928,tt9916838,nm1485677,"nm9187127,nm1485677,nm9826385,nm9299459,nm1628284"
10234929,tt9916840,"nm0584014,nm0996406","nm1482639,nm2586970"
10234930,tt9916842,nm1485677,"nm9187127,nm1485677,nm9826385,nm9299459,nm1628284"
10234931,tt9916844,nm1485677,"nm9187127,nm1485677,nm9826385,nm9299459,nm1628284"
10234932,tt9916846,nm1485677,"nm9187127,nm1485677,nm9826385,nm9299459,nm1628284"
10234933,tt9916848,nm1485677,"nm9187127,nm1485677,nm9826385,nm9299459,nm1628284"
10234934,tt9916850,nm1485677,"nm9187127,nm1485677,nm9826385,nm1628284"
10234935,tt9916852,nm1485677,"nm9187127,nm1485677,nm9826385,nm9299459,nm1628284"
10234936,tt9916856,nm10538645,nm6951431
10234937,tt9916880,"nm0584014,nm0996406","nm1482639,nm2586970"

## Save cleaned file

In [107]:
df_imdb_title_crew.to_csv('/Users/gauridhumal/Development Projects/UOL-PROJECTs/CRS/DS/crs_ds/data/processed/imdb/cleaned_title_crew.csv', index=False,)

# Process title.episode.tsv File

In [108]:
#Read the file and load the contents in a dataframe.
filename = 'title.episode.tsv'
file_path = file_core_path + filename
df_imdb_title_episode=pd.read_csv(open(file_path, 'r'),delimiter='\t')

In [109]:
df_imdb_title_episode.head()

      tconst parentTconst seasonNumber episodeNumber
0  tt0041951    tt0041038            1             9
1  tt0042816    tt0989125            1            17
2  tt0042889    tt0989125           \N            \N
3  tt0043426    tt0040051            3            42
4  tt0043631    tt0989125            2            16

In [110]:
df_imdb_title_episode.describe()

           tconst parentTconst seasonNumber episodeNumber
count     7802265      7802265      7802265       7802265
unique    7802265       194837          298         15776
top     tt0041951   tt12164062            1            \N
freq            1        18593      3971370       1586274

In [111]:
df_imdb_title_episode.isna().sum()

tconst           0
parentTconst     0
seasonNumber     0
episodeNumber    0
dtype: int64

## Save cleaned file

In [112]:
df_imdb_title_episode.to_csv('/Users/gauridhumal/Development Projects/UOL-PROJECTs/CRS/DS/crs_ds/data/processed/imdb/cleaned_title_episode.csv', index=False,)

# Process title.principals.tsv File

In [113]:
#Read the file and load the contents in a dataframe.
filename = 'title.principals.tsv'
file_path = file_core_path + filename
df_imdb_title_principals=pd.read_csv(open(file_path, 'r'),delimiter='\t')

In [114]:
df_imdb_title_principals.head(15)

,tconst,ordering,nconst,category,job,characters
0,tt0000001,1,nm1588970,self,\N,"[""Self""]"
1,tt0000001,2,nm0005690,director,\N,\N
2,tt0000001,3,nm0374658,cinematographer,director of photography,\N
3,tt0000002,1,nm0721526,director,\N,\N
4,tt0000002,2,nm1335271,composer,\N,\N
5,tt0000003,1,nm0721526,director,\N,\N
6,tt0000003,2,nm1770680,producer,producer,\N
7,tt0000003,3,nm1335271,composer,\N,\N
8,tt0000003,4,nm5442200,editor,\N,\N
9,tt0000004,1,nm0721526,director,\N,\N
10,tt0000004,2,nm1335271,composer,\N,\N
11,tt0000005,1,nm0443482,actor,\N,"[""Blacksmith""]"
12,tt0000005,2,nm0653042,actor,\N,"[""Assistant""]"
13,tt0000005,3,nm0005690,director,\N,\N
14,tt0000005,4,nm0249379,producer,producer,\N

In [115]:
df_imdb_title_principals.shape

(58613295, 6)

In [116]:
#df_imdb_title_principals['tconst'].unique().sum()

In [117]:
df_imdb_title_principals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 58613295 entries, 0 to 58613294
Data columns (total 6 columns):
 #   Column      Dtype
---  ------      -----
 0   tconst      object
 1   ordering    int64
 2   nconst      object
 3   category    object
 4   job         object
 5   characters  object
dtypes: int64(1), object(5)
memory usage: 2.6+ GB

## Clean category

In [118]:
df_categories = pd.DataFrame(df_imdb_title_principals['category'].unique())

In [119]:
df_categories.columns=['profession']

In [120]:
df_categories

             profession
0                  self
1              director
2       cinematographer
3              composer
4              producer
5                editor
6                 actor
7               actress
8                writer
9   production_designer
10      archive_footage
11        archive_sound

In [121]:
df_profession_total

0                         soundtrack
1                            actress
3                              actor
4                             writer
15                          composer
24                  music_department
32                          director
61                      music_artist
82                            editor
84                   cinematographer
92                          producer
252                     art_director
710               make_up_department
711               assistant_director
864                    miscellaneous
1674               camera_department
1890                sound_department
1898                          stunts
2149                 special_effects
2183             production_designer
2201            editorial_department
2246              production_manager
2252              costume_department
2270                casting_director
2273                costume_designer
2321                   set_decorator
2333                  art_department
2347              casting_department
2359                  visual_effects
2363             location_management
2625            animation_department
2689               script_department
2927                    talent_agent
3429       transportation_department
3757                         manager
5202                       executive
17914                          legal
19539                      publicist
29556                      podcaster
633901                     assistant
2946858                choreographer
4473034        production_department
5591197        electrical_department
dtype: object

In [122]:
df_profession = pd.DataFrame(df_profession_total)

In [123]:
df_profession.info()

<class 'pandas.core.frame.DataFrame'>
Index: 43 entries, 0 to 5591197
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       43 non-null     object
dtypes: object(1)
memory usage: 688.0+ bytes

In [124]:
df_profession.reset_index(inplace=True)

In [125]:
df_profession.drop(columns=['index'],inplace=True)

In [126]:
df_profession.columns=['profession']

In [127]:
df_profession

                   profession
0                  soundtrack
1                     actress
2                       actor
3                      writer
4                    composer
5            music_department
6                    director
7                music_artist
8                      editor
9             cinematographer
10                   producer
11               art_director
12         make_up_department
13         assistant_director
14              miscellaneous
15          camera_department
16           sound_department
17                     stunts
18            special_effects
19        production_designer
20       editorial_department
21         production_manager
22         costume_department
23           casting_director
24           costume_designer
25              set_decorator
26             art_department
27         casting_department
28             visual_effects
29        location_management
30       animation_department
31          script_department
32               talent_agent
33  transportation_department
34                    manager
35                  executive
36                      legal
37                  publicist
38                  podcaster
39                  assistant
40              choreographer
41      production_department
42      electrical_department

In [128]:
df_categories

             profession
0                  self
1              director
2       cinematographer
3              composer
4              producer
5                editor
6                 actor
7               actress
8                writer
9   production_designer
10      archive_footage
11        archive_sound

In [129]:
df_categories[~df_categories['profession'].isin(df_profession['profession'])]

         profession
0              self
10  archive_footage
11    archive_sound

In [130]:
df_imdb_title_principals['category'].value_counts()

category
actor                  12949466
self                   10090779
actress                10083535
writer                  8223647
director                6770522
producer                3820159
cinematographer         2001037
composer                1957546
editor                  1950111
archive_footage          386104
production_designer      376049
archive_sound              4340
Name: count, dtype: int64

In [131]:
df_imdb_title_principals.loc[df_imdb_title_principals['category'] == 'archive_footage'] = 'camera_department'

In [132]:
df_imdb_title_principals.loc[df_imdb_title_principals['category'] == 'archive_sound'] = 'sound_department'

In [133]:
df_imdb_title_principals.loc[df_imdb_title_principals['category'] == 'self'] = 'producer'

In [134]:
df_imdb_title_principals['category'].value_counts()

category
producer               13910938
actor                  12949466
actress                10083535
writer                  8223647
director                6770522
cinematographer         2001037
composer                1957546
editor                  1950111
camera_department        386104
production_designer      376049
sound_department           4340
Name: count, dtype: int64

## Save cleaned file

In [135]:
df_imdb_title_principals.to_csv('/Users/gauridhumal/Development Projects/UOL-PROJECTs/CRS/DS/crs_ds/data/processed/imdb/cleaned_title_principals.csv', index=False,)

# Process title.ratings.tsv file

In [136]:
#Read the file and load the contents in a dataframe.
filename = 'title.ratings.tsv'
file_path = file_core_path + filename
df_imdb_title_ratings=pd.read_csv(open(file_path, 'r'),delimiter='\t')

In [137]:
df_imdb_title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      2000
1  tt0000002            5.8       269
2  tt0000003            6.5      1890
3  tt0000004            5.5       178
4  tt0000005            6.2      2676

In [138]:
df_imdb_title_ratings.shape

(1359486, 3)

In [139]:
df_imdb_title_ratings.describe()

       averageRating      numVotes
count   1.359486e+06  1.359486e+06
mean    6.958239e+00  1.038665e+03
std     1.382237e+00  1.757342e+04
min     1.000000e+00  5.000000e+00
25%     6.200000e+00  1.100000e+01
50%     7.200000e+00  2.600000e+01
75%     7.900000e+00  1.010000e+02
max     1.000000e+01  2.807661e+06

In [140]:
df_imdb_title_ratings.isna().sum()

tconst           0
averageRating    0
numVotes         0
dtype: int64

In [141]:
df_imdb_title_ratings[df_imdb_title_ratings['tconst'].isin(df_imdb_title_basics['tconst'])]

            tconst  averageRating  numVotes
0        tt0000001            5.7      2000
1        tt0000002            5.8       269
2        tt0000003            6.5      1890
3        tt0000004            5.5       178
4        tt0000005            6.2      2676
...            ...            ...       ...
1359481  tt9916730            7.6        11
1359482  tt9916766            7.0        22
1359483  tt9916778            7.2        36
1359484  tt9916840            8.8         6
1359485  tt9916880            8.2         6

[1359483 rows x 3 columns]

In [142]:
# Titles not found in main title file. Drop these records
df_imdb_title_ratings[~df_imdb_title_ratings['tconst'].isin(df_imdb_title_basics['tconst'])]

            tconst  averageRating  numVotes
993183  tt29482985            7.2        22
993185  tt29483691            7.2        16
993214  tt29487014            3.3        12

In [143]:
df_imdb_title_ratings.drop(df_imdb_title_ratings[df_imdb_title_ratings['tconst'].isin(['tt29482985','tt29483691','tt29487014'])].index,inplace=True)

In [144]:
df_imdb_title_ratings.shape

(1359483, 3)

In [145]:
df_imdb_title_ratings[~df_imdb_title_ratings['tconst'].isin(df_imdb_title_basics['tconst'])]

Empty DataFrame
Columns: [tconst, averageRating, numVotes]
Index: []

## Save cleaned file

In [147]:
df_imdb_title_ratings.to_csv('/Users/gauridhumal/Development Projects/UOL-PROJECTs/CRS/DS/crs_ds/data/processed/imdb/cleaned_title_ratings.csv', index=False,)

In [148]:
# Number of movies which do not have user ratings -
df_imdb_title_basics[~df_imdb_title_basics['tconst'].isin(df_imdb_title_ratings['tconst'])].shape

(8872815, 9)